#### IsValidSectionTypeId Method

---

|  |
| --- |
| AnalyticalMember Class   See Also |

Checks whether the family symbol id is allowed for Analytical Member as Section Type property.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public bool IsValidSectionTypeId( 	ElementId familySymbolId ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsValidSectionTypeId ( _ 	familySymbolId As ElementId _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsValidSectionTypeId( 	ElementId^ familySymbolId ) ``` |

#### Parameters

familySymbolId
:   Type:  Autodesk.Revit.DB ElementId
     Family symbol id which has to be checked.

#### Return Value

True if %familySymbolId% is invalidElementId; or if it is the id of a FamilySymbol of category "Structural Framing" (OST\_StructuralFraming) or "Structural Columns" (OST\_StructuralColumns) Returns false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

AnalyticalMember Class

Autodesk.Revit.DB.Structure Namespace